; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	thermograph2 - mode
	infrared1 - mode
	thermograph3 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 infrared0)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 infrared0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star1)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph3)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument7 infrared1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared1)
	(supports instrument8 thermograph2)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 GroundStation0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument10 infrared0)
	(supports instrument10 thermograph2)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star1)
	(supports instrument11 infrared1)
	(calibration_target instrument11 Star1)
	(supports instrument12 infrared1)
	(calibration_target instrument12 GroundStation4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star10)
	(supports instrument13 infrared0)
	(calibration_target instrument13 GroundStation2)
	(supports instrument14 infrared0)
	(supports instrument14 thermograph3)
	(supports instrument14 infrared1)
	(calibration_target instrument14 GroundStation3)
	(supports instrument15 infrared1)
	(supports instrument15 infrared0)
	(calibration_target instrument15 GroundStation2)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(on_board instrument15 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star10)
)
(:goal (and
	(pointing satellite2 Star1)
	(pointing satellite3 Star10)
	(have_image Star5 thermograph3)
	(have_image Planet6 thermograph3)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 thermograph3)
	(have_image Phenomenon9 thermograph3)
	(have_image Star10 thermograph3)
))

)

; plan
1. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 8
2. (calibrate satellite3 instrument8 groundstation0)
   added: (calibrated instrument8)
   goals met: 0 of 8
3. (turn_to satellite3 planet6 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet6)
   goals met: 0 of 8
4. (take_image satellite3 planet6 instrument8 thermograph3)
   added: (have_image planet6 thermograph3)
   goals met: 1 of 8
5. (turn_to satellite3 phenomenon9 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon9)
   goals met: 1 of 8
6. (take_image satellite3 phenomenon9 instrument8 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 2 of 8
7. (turn_to satellite3 phenomenon7 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon7)
   goals met: 2 of 8
8. (turn_to satellite2 star1 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star1)
   goals met: 3 of 8
9. (take_image satellite3 phenomenon7 instrument8 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 4 of 8
10. (turn_to satellite3 star5 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star5)
   goals met: 4 of 8
11. (take_image satellite3 star5 instrument8 thermograph3)
   added: (have_image star5 thermograph3)
   goals met: 5 of 8
12. (turn_to satellite3 star8 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star8)
   goals met: 5 of 8
13. (take_image satellite3 star8 instrument8 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 6 of 8
14. (turn_to satellite3 star10 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star10)
   goals met: 7 of 8
15. (take_image satellite3 star10 instrument8 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 8 of 8
